In [1]:
import numpy as np
import pandas as pd

In [2]:
url = ("http://hbiostat.org/data/repo/titanic3.xls")

df = pd.read_excel(url)
orig_df = df

In [3]:
#pip install pyjanitor

### Column Names

In [4]:
import janitor as jn
Xbad = pd.DataFrame(
    {
        "A":[1, None, 3],
        "  sales numbers ": [20.0, 30.0, None]
    })

jn.clean_names(Xbad)

     a  _sales_numbers_
0  1.0             20.0
1  NaN             30.0
2  3.0              NaN

In [5]:
def clean_col(name):
    return (
        name.strip().lower().replace(" ", "_"))

Xbad.rename(columns=clean_col)

     a  sales_numbers
0  1.0           20.0
1  NaN           30.0
2  3.0            NaN

### Replacing Missing Values

In [17]:
Xbad = pd.DataFrame(
    {
        "A":[1, None, 3],
        " sales numbers ": [20.0, 30.0, None]
    })

jn.coalesce(
    Xbad,
    ["A", " sales numbers "],
    target_column_name="val",)

     A   sales numbers    val
0  1.0             20.0   1.0
1  NaN             30.0  30.0
2  3.0              NaN   3.0

In [18]:
Xbad1 = Xbad.copy()

In [19]:
Xbad1.fillna(10)

      A   sales numbers
0   1.0             20.0
1  10.0             30.0
2   3.0             10.0

In [20]:
Xbad2 = Xbad.copy()

In [22]:
jn.impute(
    Xbad2,
    ["A", " sales numbers "],
    value=10)

      A   sales numbers
0   1.0             20.0
1  10.0             30.0
2   3.0             10.0

In [23]:
df.isna().any().any()

True